ghi-electronics/TinyCLR-Ports/Targets/LPC23xx_LPC24xx/LPC24_UsbDevice.cpp
}
const TinyCLR_Api_Info*LPC24_UsbClient_GetRequiredApi() {
    return TinyCLR_UsbClient_GetRequiredApi();
}

void LPC24_UsbDevice_Reset() {
    return TinyCLR_UsbClient_Reset(0);
}

void LPC24_UsbDevice_InitializeConfiguration(UsClientState *usClientState) {
    int32_t controllerIndex = 0;

    if (usClientState != nullptr) {
        usClientState->controllerIndex = controllerIndex;

        usClientState->maxFifoPacketCount = LPC24_USB_PACKET_FIFO_COUNT;
        usClientState->totalEndpointsCount = LPC24_USB_ENDPOINT_COUNT;
        usClientState->totalPipesCount = LPC24_USB_PIPE_COUNT;

        // Update endpoint size DeviceDescriptor Configuration if device value is different to default value
        usClientState->deviceDescriptor.MaxPacketSizeEp0 = TinyCLR_UsbClient_GetEndpointSize(0);

        usbDeviceDrivers[controllerIndex].usClientState = usClientState;
    }
}

bool LPC24_UsbDevice_Initialize(UsClientState *usClientState) {
    DISABLE_INTERRUPTS_SCOPED(irq);

    if (usClientState == nullptr)
        return false;

    int32_t controllerIndex = usClientState->controllerIndex;

    LPC24_Interrupt_Activate(USB_IRQn, (uint32_t*)&LPC24_UsbDevice_InterruptHandler, 0);

    for (int32_t i = 0; i < LPC24_USB_ENDPOINT_COUNT; i++)
        EndpointInit[i].word = 0;       // All useable endpoints initialize to unused

    for (auto pipe = 0; pipe < LPC24_USB_ENDPOINT_COUNT; pipe++) {
        auto idx = 0;
        if (usClientState->pipes[pipe].RxEP != USB_ENDPOINT_NULL) {
            idx = usClientState->pipes[pipe].RxEP;
            EndpointInit[idx].bits.ED = 0;
            EndpointInit[idx].bits.DE = 0;
        }

        if (usClientState->pipes[pipe].TxEP != USB_ENDPOINT_NULL) {
            idx = usClientState->pipes[pipe].TxEP;
            EndpointInit[idx].bits.ED = 1;
            EndpointInit[idx].bits.DE = 1;
        }

        if (idx != 0) {
            EndpointInit[idx].bits.EN = idx;
            EndpointInit[idx].bits.IN = 0;//itfc->bInterfaceNumber;
            EndpointInit[idx].bits.ET = USB_ENDPOINT_ATTRIBUTE_BULK & 0x03; //ep->bmAttributes & 0x03;
            EndpointInit[idx].bits.CN = 1;        // Always only 1 configuration = 1
            EndpointInit[idx].bits.AISN = 0;        // No alternate interfaces
            EndpointInit[idx].bits.EE = 1;        // Enable this endpoint
            EndpointInit[idx].bits.MPS = usClientState->maxEndpointsPacketSize[idx];
        }
    }

    usClientState->firstGetDescriptor = true;

    LPC24_UsbDevice_ProtectPins(controllerIndex, true);

    return true;
}

bool LPC24_UsbDevice_Uninitialize(UsClientState *usClientState) {
    DISABLE_INTERRUPTS_SCOPED(irq);

    LPC24_Interrupt_Deactivate(USB_IRQn);

    if (usClientState != nullptr) {
        LPC24_UsbDevice_ProtectPins(usClientState->controllerIndex, false);
        usClientState->currentState = USB_DEVICE_STATE_UNINITIALIZED;
    }

    return true;
}

bool LPC24_UsbDevice_StartOutput(UsClientState* usClientState, int32_t endpoint) {
    int32_t m, n, val;

    DISABLE_INTERRUPTS_SCOPED(irq);

    /* if the halt feature for this endpoint is set, then just
       clear all the characters */
    if (usClientState->endpointStatus[endpoint] & USB_STATUS_ENDPOINT_HALT) {
        TinyCLR_UsbClient_ClearEndpoints(usClientState, endpoint);
        return true;
    }

    //If txRunning, interrupts will drain the queue
    if (!usbDeviceDrivers[usClientState->controllerIndex].txRunning[endpoint]) {
        usbDeviceDrivers[usClientState->controllerIndex].txRunning[endpoint] = true;

        // Calling both LPC24_UsbDevice_TxPacket & EP_TxISR in this routine could cause a TX FIFO overflow
        LPC24_UsbDevice_TxPacket(usClientState, endpoint);
    }
    else if (irq.IsDisabled()) {

        n = LPC24_UsbDevice_EPAdr(endpoint, 1); // It is an output endpoint for sure
        if ((USBEpIntSt & (1 << n)))//&& (USBEpIntEn & (1 << n)) )//only if enabled
        {
            m = n >> 1;

            if (m == 0)//EP0
            {
                USBEpIntClr = 1 << n;
                while ((USBDevIntSt & CDFULL_INT) == 0);
                val = USBCmdData;

                if (val & EP_SEL_STP)        /* Setup Packet */
                {
                    LPC24_UsbDevice_ProcessEP0(usClientState, 0, 1);// out setup
                }
                else {
                    if ((n & 1) == 0)                /* OUT Endpoint */
                    {
                        LPC24_UsbDevice_ProcessEP0(usClientState, 0, 0);// out not setup
                    }
                    else {
                        LPC24_UsbDevice_ProcessEP0(usClientState, 1, 0);// in not setup
                    }
                }
            }
            else {
                if (usClientState->queues[m] && usClientState->isTxQueue[endpoint])
                    LPC24_UsbDevice_ProcessEndPoint(usClientState, m, 1);//out
                else
                    LPC24_UsbDevice_ProcessEndPoint(usClientState, m, 0);//in
            }
        }
    }

    return true;
}

bool LPC24_UsbDevice_RxEnable(UsClientState* usClientState, int32_t endpoint) {
    if (endpoint >= LPC24_USB_ENDPOINT_COUNT)
        return false;

    DISABLE_INTERRUPTS_SCOPED(irq);

    if (nacking_rx_OUT_data[endpoint])
        LPC24_UsbDevice_Enpoint_RxInterruptHandler(usClientState, endpoint);//force interrupt to read the pending EP

    return true;
}

static uint8_t  LPC24_UsbDevice_DeviceAddress = 0;

#define CONTORL_EP_ADDR	0x80

#define USB_POWER           0
#define USB_IF_NUM          4
#define USB_EP_NUM          32
#define USB_MAX_PACKET0     64
#define USB_DMA             0
#define USB_DMA_EP          0x00000000

#define USB_POWER_EVENT     0
#define USB_RESET_EVENT     1
#define USB_WAKEUP_EVENT    0
#define USB_SOF_EVENT       0
#define USB_ERROR_EVENT     0
#define USB_EP_EVENT        0x0003
#define USB_CONFIGURE_EVENT 1
#define USB_INTERFACE_EVENT 0
#define USB_FEATURE_EVENT   0

#define EP_MSK_CTRL 0x0001      /* Control Endpoint Logical address Mask */
#define EP_MSK_BULK 0xC924      /* Bulk Endpoint Logical address Mask */
#define EP_MSK_INT  0x4492      /* Interrupt Endpoint Logical address Mask */
#define EP_MSK_ISO  0x1248      /* Isochronous Endpoint Logical address Mask */

static void LPC24_UsbDevice_WrCmd(uint32_t cmd) {
    USBDevIntClr = CCEMTY_INT | CDFULL_INT;
    USBCmdCode = cmd;
    while ((USBDevIntSt & CCEMTY_INT) == 0);
}
static void LPC24_UsbDevice_WrCmdDat(uint32_t cmd, uint32_t val) {
    USBDevIntClr = CCEMTY_INT;
    USBCmdCode = cmd;
    while ((USBDevIntSt & CCEMTY_INT) == 0);
    USBDevIntClr = CCEMTY_INT;
    USBCmdCode = val;
    while ((USBDevIntSt & CCEMTY_INT) == 0);
}
static uint32_t LPC24_UsbDevice_RdCmdDat(uint32_t cmd) {
    USBDevIntClr = CCEMTY_INT | CDFULL_INT;
    USBCmdCode = cmd;
    while ((USBDevIntSt & CDFULL_INT) == 0);
    return (USBCmdData);
}

static void LPC24_UsbDevice_SetAddress(uint32_t adr) {
    LPC24_UsbDevice_WrCmdDat(CMD_SET_ADDR, DAT_WR_BYTE(DEV_EN | adr)); /* Don't wait for next */
    LPC24_UsbDevice_WrCmdDat(CMD_SET_ADDR, DAT_WR_BYTE(DEV_EN | adr)); /*  Setup Status Phase */
}

static void LPC24_UsbDevice_HardwareReset(void) {
    USBEpInd = 0;
    USBEpMaxPSize = USB_MAX_PACKET0;
    USBEpInd = 1;
    USBEpMaxPSize = USB_MAX_PACKET0;

    while ((USBDevIntSt & EP_RLZED_INT) == 0);

    USBEpIntClr = 0xFFFFFFFF;
    USBEpIntEn = 0xFFFFFFFF ^ USB_DMA_EP;
    USBDevIntClr = 0xFFFFFFFF;
    USBDevIntEn = DEV_STAT_INT | EP_SLOW_INT |
        (USB_SOF_EVENT ? FRAME_INT : 0) |
        (USB_ERROR_EVENT ? ERR_INT : 0);

