ghi-electronics/TinyCLR-Ports/Targets/LPC23xx_LPC24xx/LPC24_UsbDevice.cpp
}

void LPC24_UsbDevice_SuspendEvent(UsClientState *usClientState) {
    // SUSPEND event only happened when Host(PC) set the device to SUSPEND
    // as there is always SOF every 1ms on the BUS to keep the device from
    // suspending. Therefore, the REMOTE wake up is not necessary at the ollie side
    usbDeviceDrivers[usClientState->controllerIndex].previousDeviceState = usClientState->deviceState;

    usClientState->deviceState = USB_DEVICE_STATE_SUSPENDED;

    TinyCLR_UsbClient_StateCallback(usClientState);
}


void LPC24_UsbDevice_ResumeEvent(UsClientState *usClientState) {
    usClientState->deviceState = usbDeviceDrivers[usClientState->controllerIndex].previousDeviceState;

    TinyCLR_UsbClient_StateCallback(usClientState);
}

void LPC24_UsbDevice_ResetEvent(UsClientState *usClientState) {
    LPC24_UsbDevice_HardwareReset();
    LPC24_UsbDevice_DeviceAddress = 0;

    // clear all flags
    TinyCLR_UsbClient_ClearEvent(usClientState, 0xFFFFFFFF);

    for (int32_t ep = 0; ep < LPC24_USB_ENDPOINT_COUNT; ep++) {
        usbDeviceDrivers[usClientState->controllerIndex].txRunning[ep] = false;
        usbDeviceDrivers[usClientState->controllerIndex].txNeedZLPS[ep] = false;
    }

    usClientState->deviceState = USB_DEVICE_STATE_DEFAULT;
    usClientState->address = 0;
    TinyCLR_UsbClient_StateCallback(usClientState);
}

bool LPC24_UsbDevice_ProtectPins(int32_t controllerIndex, bool On) {
    UsClientState *usClientState = usbDeviceDrivers[controllerIndex].usClientState;

    DISABLE_INTERRUPTS_SCOPED(irq);

    if (usClientState) {
        if (On) {
            usClientState->deviceState = USB_DEVICE_STATE_ATTACHED;

            TinyCLR_UsbClient_StateCallback(usClientState);

            LPC24_UsbDevice_StartHardware();
        }
        else {
            LPC24_UsbDevice_HardwareReset();

            LPC24_UsbDevice_DeviceAddress = 0;

            LPC24_UsbDevice_StopHardware();
        }

        return true;
    }

    return false;
}

TinyCLR_Result TinyCLR_UsbClient_GetControllerCount(const TinyCLR_UsbClient_Controller* self, int32_t& count) {
    count = LPC24_TOTAL_USB_CONTROLLERS;

    return TinyCLR_Result::Success;
}

bool TinyCLR_UsbClient_Initialize(UsClientState* usClientState) {
    return LPC24_UsbDevice_Initialize(usClientState);
}

bool TinyCLR_UsbClient_Uninitialize(UsClientState* usClientState) {
    return LPC24_UsbDevice_Uninitialize(usClientState);
}

bool TinyCLR_UsbClient_StartOutput(UsClientState* usClientState, int32_t endpoint) {
    return LPC24_UsbDevice_StartOutput(usClientState, endpoint);
}

bool TinyCLR_UsbClient_RxEnable(UsClientState* usClientState, int32_t endpoint) {
    return LPC24_UsbDevice_RxEnable(usClientState, endpoint);
}

void TinyCLR_UsbClient_Delay(uint64_t microseconds) {
    LPC24_Time_Delay(nullptr, microseconds);
}

void TinyCLR_UsbClient_InitializeConfiguration(UsClientState *usClientState) {
    LPC24_UsbDevice_InitializeConfiguration(usClientState);
}

uint32_t TinyCLR_UsbClient_GetEndpointSize(int32_t endpoint) {
    return endpoint == 0 ? LPC24_USB_ENDPOINT0_SIZE : LPC24_USB_ENDPOINT_SIZE;
}

